Repository: pallets-eco/wtforms
Catalog: wtforms/locale/*/LC_MESSAGES/wtforms.po
Languages: el

source: Invalid field name '%s'.
el: Λάθος ονομα πεδίου '%s'.

source: Field must be equal to %(other_name)s.
el: Το πεδίο πρέπει να είναι το ίδιο με το %(other_name)s.

source: Field must be at least %(num)d character long.
el: Το πεδίο πρέπει να έχει τουλάχιστον %(num)d χαρακτήρα.

source: Field cannot be longer than %(num)d character.
el: Το πεδίο δεν μπορεί να έχει πάνω απο %(num)d χαρακτήρα.

source: Field must be between %(min)d and %(max)d characters long.
el: Το πεδίο πρέπει να είναι ανάμεσα απο %(min)d και %(max)d χαρακτήρες.

source: Number must be at least %(min)s.
el: Το νούμερο πρέπει να είναι τουλάχιστον %(min)s.

source: Number must be at most %(max)s.
el: Το νούμερο πρέπει να είναι μέγιστο %(max)s.

source: Number must be between %(min)s and %(max)s.
el: Το νούμερο πρέπει να είναι ανάμεσα %(min)s και %(max)s.

source: This field is required.
el: Αυτό το πεδίο είναι υποχρεωτικό

source: Invalid input.
el: Λανθασμένα δεδωμένα

source: Invalid email address.
el: Λανθασμένο email.

source: Invalid IP address.
el: Λανθασμένο διεύθυνση IP.

source: Invalid Mac address.
el: Λανθασμένο διεύθυνση Mac.

source: Invalid URL.
el: Λανθασμένο URL.

source: Invalid UUID.
el: Λανθασμένο UUID.

source: Invalid value, must be one of: %(values)s.
el: Λάθος επιλογή, πρέπει να είναι ένα απο: %(values)s.

source: Invalid value, can't be any of: %(values)s.
el: Λάθος επιλογή, δεν μπορεί να είναι ένα απο: %(values)s.

source: Invalid CSRF Token
el: Λάθος CSRF

source: CSRF token missing
el: To CSRF δεν υπάρχει

source: CSRF failed
el: CSRF αποτυχία

source: CSRF token expired
el: CSRF έχει λήξει

source: Not a valid choice
el: Αγνωστη επιλογή

source: Not a valid list
el: Λανθασμένη λίστα

source: Not a valid integer list
el: Λανθασμένη λίστα ακέραιων τιμών

source: Please input a date/time value
el: Εισάγετε μια ημερομηνία

source: Invalid date/time input
el: Λανθασμένη ημερομηνία

source: Already exists.
el: Υπάρχει ήδη.

source: Invalid Choice: could not coerce
el: Λανθασμένη Επιλογή: δεν μετατρέπεται

source: Invalid choice(s): one or more data inputs could not be coerced
el: Λανθασμένη επιλογή(ες): κάποιες τιμές δέν μπορουσαν να μετατραπούν

source: '%(value)s' is not a valid choice for this field
el: '%(value)s' δέν είναι έγκυρη επιλογή για αυτο το πεδίο

source: Not a valid integer value
el: Δέν είναι ακέραιο νούμερο

source: Not a valid decimal value
el: Δέν είναι δεκαδικό

source: Not a valid float value
el: Δέν είναι δεκαδικό

source: Not a valid datetime value
el: Δέν είναι σώστη ημερομηνία/ώρα

source: Not a valid date value
el: Δέν είναι σωστή ημερομηνία
